Revit 2027 API
ParameterTypeId.PipeInsulationThickness Property
 "Insulation Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipeInsulationThickness { get; }
Public Shared ReadOnly Property PipeInsulationThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipeInsulationThickness {
	ForgeTypeId^ get ();
}
static member PipeInsulationThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace